app/views/static_pages/map.html.haml

:javascript
  window.places = #{@places.map { |p| [p.latitude, p.longitude, p.name] }}
---
SELECT "places".* FROM "places"