app/controllers/places_controller.rb

  def index
    if params[:category]
      @places = Place.tagged_with(params[:category])
    else
      @places = Place.all
---
SELECT "places".* FROM "places"

  def edit
    @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]

  def destroy
    @place = Place.find(params[:id])
    @place.categorizings.destroy_all
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 1]]