app/controllers/static_pages_controller.rb

  def map
    @places = Place.all
---
SELECT "places".* FROM "places"